L = ['a', 'b', 'c']
print(id(L))

L.append('d')
print(id(L))

a = 0
b = 0

while id(a) == id(b):
    a -= 1
    b -= 1

print(a)
#-6

a = 0
b = 0

while id(a) == id(b):
    a += 1
    b += 1

print(a)
#257

# Рассмотрим парочку примеров. Если мы сохраняем в две переменные одинаковые малые числа, то эти переменные будут равны в двух смыслах:
#  их значения равны (проверяем через ==), и они ссылаются на одинаковые объекты (проверяем через is).

a = 42
b = 42

print(a == b)
# True

print(a is b)
# True

#Однако, если мы проделаем то же самое, но с числами, превышающими границу, найденную в задании, то результат окажется несколько иным.

c = 123456789
d = 123456789

print(c == d)
# True

print(c is d)
# False

L = ['Hello', 'world']
M = L

print(M is L)
# True

# Очевидно, что эти списки будут равны по своим значениям (сравнивая через ==). И при таком присваивании в M скопируется не сам список L,
# а его идентификатор! Поэтому, изменяя список M, мы увидим неожиданные изменения в списке L.

M.append('!')

print(L)
# ['Hello', 'world', '!']
#Чтобы избежать такого поворота событий, список нужно копировать.

M = L.copy()

print(M is L)
# False

# Например, мы хотим хранить в кортеже информацию о торгово-развлекательном центре: его название, адрес и список магазинов.
# В общем-то такой набор информации остаётся почти всегда неизменным за исключением того, что список магазинов может изменяться 
# — какие-то закрываются, какие-то открываются или же меняют название. По этой причине такой список нельзя хранить в самом кортеже.
# Однако можно создать список (list) внутри самого кортежа.

shopping_center = ("Галерея", "Санкт-Петербург", "Лиговский пр., 30", ["H&M", "Zara"])
shopping_center[-1].append("Uniqlo")

print(shopping_center)
# ('Галерея', 'Санкт-Петербург', 'Лиговский пр., 30', ['H&M', 'Zara', 'Uniqlo'])

print(id(shopping_center))

shopping_center = ("Галерея", "Санкт-Петербург", "Лиговский пр., 30", ["H&M", "Zara"])
list_id_before = id(shopping_center[-1])

shopping_center[-1].append("Uniqlo")
list_id_after = id(shopping_center[-1])

print(list_id_before == list_id_after)

# Множество — это неупорядоченный набор уникальных элементов. Иными словами, во множествах не могут повторяться элементы, 
# а хранятся они в памяти компьютера в произвольном порядке.

# Создать множество можно несколькими способами:

a = {'a', 'b', 'c', 'd'} # используя синтаксис { }

# или, что нам будет более полезно, множество можно создать из списка с помощью приведения типов:
L = [1,1,2,3,2]

b = set(L)

print(b)
# {1,2,3}

# Осталось только множество вернуть обратно в списковое представление, опять же используя явное приведение типов.
b_list = list(b)

print(b_list)
# [1,2,3]


# А для краткости все эти операции можно записать в одну строку, ведь в Python естественным образом заложена лаконичность кода.

c = list(set(L))

print(c)
# [1,2,3]


# text = input("Введите текст, а я вам кол-во уникальных символов :-)")

# f = list(set(text))
# print(len(f))

# Множества в Python аналогичны математическим множествам, поэтому для них существует несколько собственных операций.

# Операция	                        Название	            Смысл
# set.union(other)	                Объединение	            Возвращает множество, состоящее из элементов set и other.
# set.intersection(other)	        Пересечение	            Возвращает множество, состоящее из элементов, которые встречаются и в set, и в other.
# set.difference(other)	            Разность	            Возвращает множество элементов set, которые не встречаются в other.
# set.symmetric_difference(other)	Симметричная разность	Возвращает множество элементов, встречающиеся в одном из множеств, но не в обоих одновременно.

abons = {"Иванов", "Петров", "Васильев", "Антонов"}

debtors = {"Петров", "Антонов"}

non_debtors = abons.difference(debtors)

print(non_debtors)
# {'Васильев', 'Иванов'}


a = (input("Введите первую строку: "))
b = (input("Введите вторую строку: "))

a_set, b_set = set(a), set(b) # используем множественное присваивание

a_and_b = a_set.symmetric_difference(b_set)

print(list(a_and_b))

# 1 2 3 4 5 6 7 8
# 2 4 6 8 10 12
# Напишите программу, которая на вход получает две последовательности целых чисел, а возвращает список элементов, 
# встречающихся только в одной из последовательностей.

a = [1, 2, 3, 4, 5, 6, 7, 8,]
b = [2,4,6,8,10,12]

a_set, b_set = set(a), set(b) # используем множественное присваивание

a_and_b = a_set.symmetric_difference(b_set)

print(list(a_and_b))

